# -*- coding: utf-8 -*-
__author__ = 'quqiao'

"""
题目：有四个数字：1、2、3、4，能组成多少个互不相同且无重复数字的三位数？各是多少？
程序分析：可填在百位、十位、个位的数字都是1、2、3、4。组成所有的排列后再去掉不满足条件的排列
"""
# for i in range(1, 5):
#     for j in range(1, 5):
#         for k in range(1, 5):
#             if (i != k) and (k != j) and (j != i):
#                 print(i, j, k)

"""
题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
      利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
      20万到40万之间时，高于20万元的部分，可提成5%；
      40万到60万之间时高于40万元的部分，可提成3%；
      60万到100万之间时，高于60万元的部分，可提成1.5%，
      高于100万元时，超过100万元的部分按1%提成，
      从键盘输入当月利润I，求应发放奖金总数？
程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。
"""
# I = int(input("请输入金额："))
# if I <= 100000:
#     print(I*0.1)
# elif 100000 < I <=200000:
#     print(100000*0.1 + (I-100000)*0.075)
# elif 200000 <= I <= 400000:
#     print(100000*0.1 + 100000*0.075+(I-200000)*0.05)
# elif 400000 <= I <= 600000:
#     print(100000*0.1 + 100000*0.075+200000*0.05+(I-400000)*0.03)
# elif 600000 <= I <= 1000000:
#     print(100000*0.1 + 100000*0.075+200000*0.05+200000*0.03+(I-600000)*0.015)
# elif I > 1000000:
#     print(100000*0.1 + 100000*0.075+200000*0.05+200000*0.03+400000*0.015+(I-1000000)*0.01)

# i = int(input('净利润：'))
# arr = [1000000, 6000000, 400000, 200000, 100000, 0]
# rat = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
# r = 0
# for idx in range(0, 6):
#     if i > arr[idx]:
#         r += (i-arr[idx])*rat[idx]
#         i = arr[idx]
# print(r)

"""
输入三个整数x,y,z，请把这三个数由小到大输出
"""
# l = []
# for i in range(3):
#     x = int(input("输入数字："))
#     l.append(x)
# l.sort()
# print(l)

"""
题目：斐波那契数列。
"""
# 输出斐波那契数相加
# def fb(n):
#     a, b = 1, 1
#     for i in range(n-1):
#         a, b = b, a+b
#     return a
# print(fb(10))

# 输入斐波那契数列
# def fb(b):
#     if b == 1:
#         return [1]
#     if b == 2:
#         return [1, 1]
#     fibs = [1, 1]
#     for i in range(2, b):
#         fibs.append(fibs[-1] + fibs[-2])
#     return fibs
# print(fb(10))

"""
题目：99乘法表
"""
# for i in range(1, 10):
#     for j in range(1, i+1):
#         print("%d*%d=%d"%(i, j, i*j))

"""
题目：判断101-200之间有多少个素数，并输出所有素数。
"""
h = 0
leap = 1
from math import sqrt
for m in range(101, 201):
    k = int(sqrt(m + 1))
    for i in range(2, k + 1):
        if m % i == 0:
            leap = 0
            break
    if leap == 1:
        print('%-4d' % m)
        h += 1
        if h % 10 == 0:
            print('')
    leap = 1
print('The total is %d' % h)